app/views/products/index.html.erb

SELECT "products".* FROM "products"
---
<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    let id = $(this).data("id");
    $.get("/products/" + id + ".json", function(product) {
      debugger;
      let inventoryText = "<strong>Available</strong>";
      if(product["inventory"] === 0){
        inventoryText = "<strong>Sold Out</strong>";
      }
      let orders = product["orders"];
      let ordersText = "";
      orders.forEach(function(order) {
        ordersText += "<ul><li>" + "Order # " + order["id"] + "</li>"
        ordersText += "<li>" + "Created At: " + order["created_at"] + "</li>"
      let products = order["products"]
        ordersText += "<ul>" + "Products: " + "<ul>"
        products.forEach(function(product) {
          ordersText += "<li>" + product["name"] + "</li>"
        })
      })
      let descriptionText = "<p>" + product["description"] + "<p>" + inventoryText + "<p>" + "</p><p>" + ordersText + "</p>";